Repository: deuterium33/Sigima
Catalog: doc/locale/*/LC_MESSAGES/auto_examples/image_creation.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_image_creation.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_image_creation.py>` pour télécharger le code complet de l'exemple.

source: Creating Images
fr: Création d'Images

source: This example focuses on creating 2D image objects in Sigima.
fr: Cet exemple se concentre sur la création d'objets image 2D dans Sigima.

source: There are three primary methods to create images in Sigima:
fr: Il existe trois méthodes principales pour créer des images dans Sigima :

source: **Synthetic data generation**: Using built-in parameter classes to create standard
fr: **Génération de données synthétiques** : Utilisation des classes de paramètres intégrées pour créer des types d'images standard

source: image types (Gaussian, ramp, random distributions, etc.)
fr: types d'images (Gaussien, rampe, distributions aléatoires, etc.)

source: **Loading from files**: Importing data from various file formats
fr: **Chargement à partir de fichiers** : Importation de données à partir de divers formats de fichiers

source: **From NumPy arrays**: Creating objects directly from existing arrays
fr: **À partir de tableaux NumPy** : Création d'objets directement à partir de tableaux existants

source: Each method has its use cases, and Sigima provides a consistent interface for working with data regardless of its origin.
fr: Chaque méthode a ses cas d'utilisation, et Sigima fournit une interface cohérente pour travailler avec des données, quelle que soit leur origine.

source: For visualization, we use helper functions from the ``sigima.tests.vistools`` module. This allows us to focus on Sigima's functionality rather than visualization details.
fr: Pour la visualisation, nous utilisons des fonctions d'assistance du module ``sigima.tests.vistools``. Cela nous permet de nous concentrer sur la fonctionnalité de Sigima plutôt que sur les détails de visualisation.

source: Importing necessary modules
fr: Importation des modules nécessaires

source: First of all, we need to import the required modules.
fr: Tout d'abord, nous devons importer les modules requis.

source: Method 1: Creating images from synthetic parameters
fr: Méthode 1 : Création d'images à partir de paramètres synthétiques

source: Similar to signals, Sigima can generate synthetic images using parameter classes.
fr: Tout comme pour les signaux, Sigima peut générer des images synthétiques en utilisant des classes de paramètres.

source: Available image types include:
fr: Les types d'images disponibles incluent :

source: Distributions: Normal (Gaussian noise), Uniform, Poisson
fr: Distributions : Normale (bruit gaussien), Uniforme, Poisson

source: Analytical functions: 2D Gaussian, 2D ramp (bilinear form)
fr: Fonctions analytiques : Gaussienne 2D, rampe 2D (forme bilinéaire)

source: Blank images: Zeros
fr: Images vierges : Zéros

source: Method 2: Loading images from files
fr: Méthode 2 : Chargement d'images à partir de fichiers

source: Sigima supports a wide range of image file formats, both common and scientific.
fr: Sigima prend en charge un large éventail de formats de fichiers d'images, à la fois courants et scientifiques.

source: Supported formats include:
fr: Les formats pris en charge incluent :

source: Common formats: BMP, JPEG, PNG, TIFF, JPEG 2000
fr: Formats courants : BMP, JPEG, PNG, TIFF, JPEG 2000

source: Scientific formats: DICOM, Andor SIF, Spiricon, Dürr NDT
fr: Formats scientifiques : DICOM, Andor SIF, Spiricon, Dürr NDT

source: Data formats: NumPy (.npy), MATLAB (.mat), HDF5 (.h5img)
fr: Formats de données : NumPy (.npy), MATLAB (.mat), HDF5 (.h5img)

source: Text formats: CSV, TXT, ASC (with coordinate support)
fr: Formats texte : CSV, TXT, ASC (avec support des coordonnées)

source: Method 3: Creating images from NumPy arrays
fr: Méthode 3 : Création d'images à partir de tableaux NumPy

source: Convert existing NumPy arrays into Sigima image objects to add metadata, coordinate systems, and enable advanced processing.
fr: Convertir des tableaux NumPy existants en objets image Sigima pour ajouter des métadonnées, des systèmes de coordonnées et permettre un traitement avancé.

source: Summary
fr: Résumé

source: This example demonstrated the three main ways to create images in Sigima:
fr: Cet exemple a démontré les trois principales façons de créer des images dans Sigima :

source: **Synthetic generation**: Fast creation of standard mathematical functions and distributions using parameter classes. Perfect for testing and simulation.
fr: **Génération synthétique** : Création rapide de fonctions et de distributions mathématiques standard à l'aide de classes de paramètres. Parfait pour les tests et la simulation.

source: **File loading**: Read data from various scientific and common file formats, with automatic format detection and metadata extraction. Essential for working with experimental data.
fr: **Chargement de fichiers** : Lecture de données à partir de divers formats de fichiers scientifiques et courants, avec détection automatique du format et extraction des métadonnées. Essentiel pour travailler avec des données expérimentales.

source: **NumPy array conversion**: Wrap existing array data with Sigima's rich metadata and processing capabilities. Ideal for custom workflows and integration with other Python libraries.
fr: **Conversion de tableaux NumPy** : Enveloppez les données de tableau existantes avec les riches métadonnées et capacités de traitement de Sigima. Idéal pour les flux de travail personnalisés et l'intégration avec d'autres bibliothèques Python.

source: All three methods produce equivalent Sigima objects that can be processed, analyzed, and visualized using the same set of tools and functions. Choose the method that best fits your workflow and data source.
fr: Les trois méthodes produisent des objets Sigima équivalents qui peuvent être traités, analysés et visualisés à l'aide du même ensemble d'outils et de fonctions. Choisissez la méthode qui correspond le mieux à votre flux de travail et à votre source de données.

source: :download:`Download Jupyter notebook: image_creation.ipynb <image_creation.ipynb>`
fr: :download:`Télécharger le notebook Jupyter : image_creation.ipynb <image_creation.ipynb>`

source: :download:`Download Python source code: image_creation.py <image_creation.py>`
fr: :download:`Télécharger le code source Python : image_creation.py <image_creation.py>`

source: :download:`Download zipped: image_creation.zip <image_creation.zip>`
fr: :download:`Télécharger le fichier compressé : image_creation.zip <image_creation.zip>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
