Repository: deuterium33/Sigima
Catalog: doc/locale/*/LC_MESSAGES/auto_examples/index.po
Languages: fr

source: Gallery of examples
fr: Galerie d'exemples

source: This section presents a gallery of examples demonstrating the capabilities of Sigima. Each example is a standalone Python script that showcases specific features or use cases of the Sigima library, along with visualizations of the results (using an internal plotting module `sigima.tests.vistools` based on `PlotPyStack <https://github.com/PlotPyStack>`_).
fr: Cette section présente une galerie d'exemples démontrant les capacités de Sigima. Chaque exemple est un script Python autonome qui met en valeur des fonctionnalités ou des cas d'utilisation spécifiques de la bibliothèque Sigima, ainsi que des visualisations des résultats (en utilisant un module de tracé interne `sigima.tests.vistools` basé sur `PlotPyStack <https://github.com/PlotPyStack>`_).

source: Of course, some of these examples may seem trivial, but they serve to illustrate how to use various functionalities of Sigima in a clear and concise manner.
fr: Bien sûr, certains de ces exemples peuvent sembler triviaux, mais ils servent à illustrer comment utiliser diverses fonctionnalités de Sigima de manière claire et concise.

source: These examples are automatically generated when building the documentation, thus ensuring that they are always up-to-date with the latest version of Sigima.
fr: Ces exemples sont générés automatiquement lors de la construction de la documentation, garantissant ainsi qu'ils sont toujours fonctionnels avec la dernière version de Sigima.

source: Introductory Examples
fr: Exemples introductifs

source: These examples demonstrate basic usage of Sigima.
fr: Ces exemples démontrent l'utilisation de base de Sigima.

source: Feature Examples
fr: Exemples de fonctionnalités

source: These examples show signal and image processing features of Sigima.
fr: Ces exemples montrent les fonctionnalités de traitement du signal et de l'image de Sigima.

source: Advanced Examples
fr: Exemples avancés

source: These examples show advanced features and integration capabilities of Sigima.
fr: Ces exemples illustrent les fonctionnalités avancées et les capacités d'intégration de Sigima.

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
