Repository: deuterium33/Sigima
Catalog: doc/locale/*/LC_MESSAGES/auto_examples/signal_creation.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_signal_creation.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_signal_creation.py>` pour télécharger le code complet de l'exemple.

source: Creating Signals in Sigima
fr: Création de signaux dans Sigima

source: This example demonstrates the three main approaches for creating signals in Sigima:
fr: Cet exemple illustre les trois principales approches pour créer des signaux dans Sigima :

source: **Synthetic data generation**: Using built-in parameter classes to create standard
fr: **Génération de données synthétiques** : Utilisation des classes de paramètres intégrées pour créer des types de signaux standard

source: signal types (Gaussian, sine waves, random distributions, etc.)
fr: types de signaux (Gaussien, ondes sinusoïdales, distributions aléatoires, etc.)

source: **Loading from files**: Importing data from various file formats
fr: **Chargement à partir de fichiers** : Importation de données à partir de divers formats de fichiers

source: **From NumPy arrays**: Creating objects directly from existing arrays
fr: **À partir de tableaux NumPy** : Création d'objets directement à partir de tableaux existants

source: Each method has its use cases, and Sigima provides a consistent interface for working with data regardless of its origin.
fr: Chaque méthode a ses cas d'utilisation, et Sigima fournit une interface cohérente pour travailler avec des données, quelle que soit leur origine.

source: For visualization, we use helper functions from the ``sigima.tests.vistools`` module. This allows us to focus on Sigima's functionality rather than visualization details.
fr: Pour la visualisation, nous utilisons des fonctions d'assistance du module ``sigima.tests.vistools``. Cela nous permet de nous concentrer sur la fonctionnalité de Sigima plutôt que sur les détails de visualisation.

source: Importing necessary modules
fr: Importation des modules nécessaires

source: First of all, we need to import the required modules.
fr: Tout d'abord, nous devons importer les modules requis.

source: Method 1: Creating signals from synthetic parameters
fr: Méthode 1 : Création de signaux à partir de paramètres synthétiques

source: Sigima provides built-in generators for common signal types. This is the most convenient method when you need standard mathematical functions or random distributions.
fr: Sigima fournit des générateurs intégrés pour les types de signaux courants. C'est la méthode la plus pratique lorsque vous avez besoin de fonctions mathématiques standard ou de distributions aléatoires.

source: Available signal types include:
fr: Les types de signaux disponibles incluent :

source: Mathematical functions: Gaussian, Lorentzian, Sinc, Sine, Cosine, etc.
fr: Fonctions mathématiques : Gaussienne, Lorentzienne, Sinc, Sinusoïdale, Cosinus, etc.

source: Random distributions: Normal, Uniform, Poisson
fr: Distributions aléatoires : Normale, Uniforme, Poisson

source: Standard waveforms: Square, Sawtooth, Triangle
fr: Formes d'onde standard : Carrée, Dent de scie, Triangle

source: Special functions: Planck (blackbody), Linear chirp, Step, Exponential
fr: Fonctions spéciales : Planck (corps noir), Chirp linéaire, Palier, Exponentielle

source: Method 2: Loading signals from files
fr: Méthode 2 : Chargement de signaux à partir de fichiers

source: Sigima can read signals from various file formats, automatically detecting the format and extracting metadata when available.
fr: Sigima peut lire des signaux à partir de divers formats de fichiers, détectant automatiquement le format et extrayant les métadonnées lorsque cela est possible.

source: Supported formats include:
fr: Les formats pris en charge incluent :

source: Text files: CSV, TXT (with automatic delimiter detection)
fr: Fichiers texte : CSV, TXT (avec détection automatique du délimiteur)

source: Scientific formats: HDF5 (.h5sig), MAT-Files (.mat), NumPy (.npy)
fr: Formats scientifiques : HDF5 (.h5sig), MAT-Files (.mat), NumPy (.npy)

source: Specialized: MCA spectrum files (.mca), FT-Lab (.sig)
fr: Spécialisé : Fichiers de spectre MCA (.mca), FT-Lab (.sig)

source: It is interesting to remark here that when importing data from files, Sigima automatically extracts and preserves metadata when possible. This includes:
fr: Il est intéressant de noter qu'en important des données à partir de fichiers, Sigima extrait et préserve automatiquement les métadonnées lorsque cela est possible. Cela inclut :

source: **Axis labels and units**: Column headers from CSV files, variable names from MAT-Files, etc.
fr: **Étiquettes et unités des axes** : En-têtes de colonnes des fichiers CSV, noms de variables des fichiers MAT, etc.

source: **Acquisition parameters**: DICOM headers, instrument settings, timestamps
fr: **Paramètres d'acquisition** : En-têtes DICOM, paramètres d'instrument, horodatages

source: **Physical coordinates**: Pixel spacing, origin coordinates when stored in the file
fr: **Coordonnées physiques** : Espacement des pixels, coordonnées d'origine lorsqu'elles sont stockées dans le fichier

source: The extracted metadata is seamlessly integrated into the signal or image object, making it available for processing, analysis, and visualization without manual configuration.
fr: Les métadonnées extraites sont intégrées de manière transparente dans l'objet de signal ou d'image, les rendant disponibles pour le traitement, l'analyse et la visualisation sans configuration manuelle.

source: Method 3: Creating signals from NumPy arrays
fr: Méthode 3 : Création de signaux à partir de tableaux NumPy

source: When you already have data in NumPy arrays (from calculations, other libraries, or custom data sources), you can wrap them in Sigima signal objects to benefit from metadata handling and processing functions.
fr: Lorsque vous avez déjà des données dans des tableaux NumPy (provenant de calculs, d'autres bibliothèques ou de sources de données personnalisées), vous pouvez les envelopper dans des objets de signal Sigima pour bénéficier de la gestion des métadonnées et des fonctions de traitement.

source: Summary
fr: Résumé

source: This example demonstrated the three main ways to create signals in Sigima:
fr: Cet exemple a démontré les trois principales façons de créer des signaux dans Sigima :

source: **Synthetic generation**: Fast creation of standard mathematical functions and distributions using parameter classes. Perfect for testing and simulation.
fr: **Génération synthétique** : Création rapide de fonctions et de distributions mathématiques standard à l'aide de classes de paramètres. Parfait pour les tests et la simulation.

source: **File loading**: Read data from various scientific and common file formats, with automatic format detection and metadata extraction. Essential for working with experimental data.
fr: **Chargement de fichiers** : Lecture de données à partir de divers formats de fichiers scientifiques et courants, avec détection automatique du format et extraction des métadonnées. Essentiel pour travailler avec des données expérimentales.

source: **NumPy array conversion**: Wrap existing array data with Sigima's rich metadata and processing capabilities. Ideal for custom workflows and integration with other Python libraries.
fr: **Conversion de tableaux NumPy** : Enveloppez les données de tableau existantes avec les riches métadonnées et capacités de traitement de Sigima. Idéal pour les flux de travail personnalisés et l'intégration avec d'autres bibliothèques Python.

source: All three methods produce equivalent Sigima objects that can be processed, analyzed, and visualized using the same set of tools and functions. Choose the method that best fits your workflow and data source.
fr: Les trois méthodes produisent des objets Sigima équivalents qui peuvent être traités, analysés et visualisés à l'aide du même ensemble d'outils et de fonctions. Choisissez la méthode qui correspond le mieux à votre flux de travail et à votre source de données.

source: :download:`Download Jupyter notebook: image_creation.ipynb <image_creation.ipynb>`
fr: :download:`Télécharger le notebook Jupyter : image_creation.ipynb <image_creation.ipynb>`

source: :download:`Download Python source code: image_creation.py <image_creation.py>`
fr: :download:`Télécharger le code source Python : image_creation.py <image_creation.py>`

source: :download:`Download zipped: image_creation.zip <image_creation.zip>`
fr: :download:`Télécharger le fichier compressé : image_creation.zip <image_creation.zip>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
