Repository: deuterium33/Sigima
Catalog: doc/locale/*/LC_MESSAGES/auto_examples/trivial.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_trivial.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_trivial.py>` pour télécharger le code complet de l'exemple.

source: Basic Signal and Image Operations with Sigima
fr: Explorer les opérations de base sur les signaux et images avec Sigima

source: This example demonstrates the most basic operations with Sigima:
fr: Cet exemple présente les opérations les plus simples avec Sigima :

source: Creating signals from NumPy arrays
fr: Créer des signaux à partir de tableaux NumPy

source: Performing arithmetic operations on signals
fr: Effectuer des opérations arithmétiques sur des signaux

source: Creating images from NumPy arrays
fr: Créer des images à partir de tableaux NumPy

source: Performing arithmetic operations on images
fr: Effectuer des opérations arithmétiques sur des images

source: This is a simple introduction to get started with Sigima's core functionality.
fr: C'est une introduction simple pour découvrir les fonctionnalités essentielles de Sigima.

source: In order to visualize the results, you can use your favorite visualization tool. Anyway, for convenience, all the example will use the PlotPy library: this is a library that has been written with efficience in mind, and that can directly handle Sigima objects. In order to simplify the maximum the visualization code, few visualization functions have been included in Sigima's test suite: these functions are imported from the sigima.tests.vistools module and used in this example. This will allow us to keep the focus on Sigima functionalities rather than on visualization details.
fr: Pour visualiser les résultats, vous pouvez utiliser votre outil de visualisation préféré. Pour notre part, par souci de commodité, on utilise la bibliothèque PlotPy : elle a été conçue pour être efficace et sait manipuler directement les objets Sigima. Afin de simplifier au maximum le code de visualisation, quelques fonctions dédiées ont été incluses dans la suite de tests de Sigima ; elles sont importées depuis le module sigima.tests.vistools et utilisées dans cet exemple. Cela nous permet de rester concentrés sur les fonctionnalités de Sigima plutôt que sur les détails de visualisation.

source: Importing necessary modules
fr: Importer les modules nécessaires

source: Import necessary modules for signal and image processing.
fr: On importe les modules requis pour le traitement des signaux et des images.

source: Creating and combining signals
fr: Créer et combiner des signaux

source: In Sigima, signals can be created in multiple ways: - From NumPy arrays (as shown here) - By importing from various data formats - Using built-in functions for commonly used signal types (sine, square waves, etc.)
fr: Dans Sigima, on peut créer des signaux de plusieurs manières : - À partir de tableaux NumPy (comme ici) - En important différents formats de données - En utilisant des fonctions intégrées pour des signaux courants (sinusoïdes, carrés, etc.)

source: This example demonstrates the simplest approach: creating signals directly from existing NumPy arrays.
fr: Cet exemple illustre l'approche la plus simple : créer des signaux directement à partir de tableaux NumPy existants.

source: Qt widget 1
fr: Widget Qt 1

source: Creating and combining images
fr: Créer et combiner des images

source: In Sigima, images can be created in multiple ways: - From NumPy arrays (as shown here) - By importing from various image file formats (TIFF, PNG, JPEG, etc.) - Using built-in functions for commonly used signals (Gaussian beams, gratings, etc.)
fr: Dans Sigima, on peut créer des images de plusieurs manières : - À partir de tableaux NumPy (comme ici) - En important divers formats d'images (TIFF, PNG, JPEG, etc.) - En utilisant des fonctions intégrées pour des signaux courants (faisceaux gaussiens, réseaux, etc.)

source: This example demonstrates the simplest approach: creating images directly from existing NumPy arrays. Here we create two 2D Gaussian images with different centers and widths, then combine them.
fr: Cet exemple montre l'approche la plus simple : créer des images directement à partir de tableaux NumPy existants. On génère ici deux images gaussiennes 2D avec des centres et des largeurs différents, puis on les combine.

source: :download:`Download Jupyter notebook: trivial.ipynb <trivial.ipynb>`
fr: :download:`Télécharger le notebook Jupyter : trivial.ipynb <trivial.ipynb>`

source: :download:`Download Python source code: trivial.py <trivial.py>`
fr: :download:`Télécharger le code source Python : trivial.py <trivial.py>`

source: :download:`Download zipped: trivial.zip <trivial.zip>`
fr: :download:`Télécharger l'archive zip : trivial.zip <trivial.zip>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
